In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [4]:
df['email']

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df.set_index('email', inplace = True)

In [7]:
df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [8]:
df.loc['JaneDoe@email.com']

first    Jane
last      Doe
Name: JaneDoe@email.com, dtype: object

In [9]:
 df

                         first     last
email
CoreyMSchafer@gmail.com  Corey  Schafer
JaneDoe@email.com         Jane      Doe
JohnDoe@email.com         John      Doe

In [10]:
df.reset_index(inplace = True)

In [11]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [12]:
df['last'] == 'Doe'

0    False
1     True
2     True
Name: last, dtype: bool

In [13]:
filt = (df['last'] == 'Doe')

In [14]:
df[filt]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [15]:
df.loc[filt]

               email first last
1  JaneDoe@email.com  Jane  Doe
2  JohnDoe@email.com  John  Doe

In [16]:
df

                     email  first     last
0  CoreyMSchafer@gmail.com  Corey  Schafer
1        JaneDoe@email.com   Jane      Doe
2        JohnDoe@email.com   John      Doe

In [17]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [18]:
 df.columns = ['email', 'first_name', 'last_name']

In [19]:
df.columns = [x.upper() for x in df.columns]

In [20]:
df.columns = df.columns.str.replace('_', ' ')

In [21]:
df

                     EMAIL FIRST NAME LAST NAME
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [22]:
df.columns = [x.lower() for x in df.columns]

In [23]:
df.rename(columns = {'email' : 'personal email'}, inplace = True)

In [24]:
df

            personal email first name last name
0  CoreyMSchafer@gmail.com      Corey   Schafer
1        JaneDoe@email.com       Jane       Doe
2        JohnDoe@email.com       John       Doe

In [25]:
df = df.iloc[:, [2, 1, 0]]

In [26]:
df

  last name first name           personal email
0   Schafer      Corey  CoreyMSchafer@gmail.com
1       Doe       Jane        JaneDoe@email.com
2       Doe       John        JohnDoe@email.com

In [27]:
df.loc[0, ['last name', 'first name']] = ['t', 'Tin']

In [28]:
df

  last name first name           personal email
0         t        Tin  CoreyMSchafer@gmail.com
1       Doe       Jane        JaneDoe@email.com
2       Doe       John        JohnDoe@email.com

In [29]:
df.loc[df['first name'] == 'Tin', 'last name'] = 'Nguyen'

In [30]:
df

  last name first name           personal email
0    Nguyen        Tin  CoreyMSchafer@gmail.com
1       Doe       Jane        JaneDoe@email.com
2       Doe       John        JohnDoe@email.com

In [31]:
df = df.iloc[:, [0,1,2]]

In [32]:
df

  last name first name           personal email
0    Nguyen        Tin  CoreyMSchafer@gmail.com
1       Doe       Jane        JaneDoe@email.com
2       Doe       John        JohnDoe@email.com

In [33]:
df

  last name first name           personal email
0    Nguyen        Tin  CoreyMSchafer@gmail.com
1       Doe       Jane        JaneDoe@email.com
2       Doe       John        JohnDoe@email.com

In [34]:
df['personal email'] = df['personal email'].str.lower()

In [35]:
df['personal email'].apply(len)

0    23
1    17
2    17
Name: personal email, dtype: int64

In [36]:
def update_email(email):
    return email.upper()

In [37]:
df

  last name first name           personal email
0    Nguyen        Tin  coreymschafer@gmail.com
1       Doe       Jane        janedoe@email.com
2       Doe       John        johndoe@email.com

In [38]:
df['personal email'] = df['personal email'].apply(update_email)

In [39]:
df

  last name first name           personal email
0    Nguyen        Tin  COREYMSCHAFER@GMAIL.COM
1       Doe       Jane        JANEDOE@EMAIL.COM
2       Doe       John        JOHNDOE@EMAIL.COM

In [40]:
df

  last name first name           personal email
0    Nguyen        Tin  COREYMSCHAFER@GMAIL.COM
1       Doe       Jane        JANEDOE@EMAIL.COM
2       Doe       John        JOHNDOE@EMAIL.COM

In [41]:
df.applymap(len)

   last name  first name  personal email
0          6           3              23
1          3           4              17
2          3           4              17

In [42]:
df.apply(len)

last name         3
first name        3
personal email    3
dtype: int64

In [43]:
df.apply(lambda x : x.min())

last name                             Doe
first name                           Jane
personal email    COREYMSCHAFER@GMAIL.COM
dtype: object

In [44]:
df

  last name first name           personal email
0    Nguyen        Tin  COREYMSCHAFER@GMAIL.COM
1       Doe       Jane        JANEDOE@EMAIL.COM
2       Doe       John        JOHNDOE@EMAIL.COM

In [45]:
df['last name'] = df['last name'].replace({'Nguyen':'Tran'})

In [46]:
df

  last name first name           personal email
0      Tran        Tin  COREYMSCHAFER@GMAIL.COM
1       Doe       Jane        JANEDOE@EMAIL.COM
2       Doe       John        JOHNDOE@EMAIL.COM

In [47]:
df.apply(len)

last name         3
first name        3
personal email    3
dtype: int64

In [48]:
df['full name'] = df['first name'] + ' ' + df['last name']

In [49]:
df

  last name first name           personal email full name
0      Tran        Tin  COREYMSCHAFER@GMAIL.COM  Tin Tran
1       Doe       Jane        JANEDOE@EMAIL.COM  Jane Doe
2       Doe       John        JOHNDOE@EMAIL.COM  John Doe

In [50]:
df['index'] = ' '

In [51]:
df

  last name first name           personal email full name index
0      Tran        Tin  COREYMSCHAFER@GMAIL.COM  Tin Tran
1       Doe       Jane        JANEDOE@EMAIL.COM  Jane Doe
2       Doe       John        JOHNDOE@EMAIL.COM  John Doe

In [52]:
df.drop(columns =['index'], inplace = True)

In [53]:
df

  last name first name           personal email full name
0      Tran        Tin  COREYMSCHAFER@GMAIL.COM  Tin Tran
1       Doe       Jane        JANEDOE@EMAIL.COM  Jane Doe
2       Doe       John        JOHNDOE@EMAIL.COM  John Doe

In [54]:
df['full name'].str.split(' ', expand = True)

      0     1
0   Tin  Tran
1  Jane   Doe
2  John   Doe

In [55]:
df

  last name first name           personal email full name
0      Tran        Tin  COREYMSCHAFER@GMAIL.COM  Tin Tran
1       Doe       Jane        JANEDOE@EMAIL.COM  Jane Doe
2       Doe       John        JOHNDOE@EMAIL.COM  John Doe

In [56]:
df.drop(columns = ['last name', 'first name'], inplace = True)

In [57]:
df

            personal email full name
0  COREYMSCHAFER@GMAIL.COM  Tin Tran
1        JANEDOE@EMAIL.COM  Jane Doe
2        JOHNDOE@EMAIL.COM  John Doe

In [58]:
df[['first', 'last']] = df['full name'].str.split(' ', expand = True)

In [59]:
df

            personal email full name first  last
0  COREYMSCHAFER@GMAIL.COM  Tin Tran   Tin  Tran
1        JANEDOE@EMAIL.COM  Jane Doe  Jane   Doe
2        JOHNDOE@EMAIL.COM  John Doe  John   Doe

In [60]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [61]:
new_row = pd.DataFrame({'personal email': ['tintokaka@gmail.com'], 'first': ['tin'], 'last': ['nguyen']})
df = pd.concat([df, new_row])

In [62]:
df

            personal email full name first    last
0  COREYMSCHAFER@GMAIL.COM  Tin Tran   Tin    Tran
1        JANEDOE@EMAIL.COM  Jane Doe  Jane     Doe
2        JOHNDOE@EMAIL.COM  John Doe  John     Doe
0      tintokaka@gmail.com       NaN   tin  nguyen

In [63]:
df.drop(columns = 'personal email',inplace = True)

In [64]:
df

  full name first    last
0  Tin Tran   Tin    Tran
1  Jane Doe  Jane     Doe
2  John Doe  John     Doe
0       NaN   tin  nguyen

In [65]:
df.drop(index = [0, 2])

  full name first last
1  Jane Doe  Jane  Doe

In [66]:
new_row = pd.DataFrame({'personal email': ['tintokaka@gmail.com'], 'first': ['tin'], 'last': ['nguyen']})
df = pd.concat([df, new_row])

In [67]:
df

  full name first    last       personal email
0  Tin Tran   Tin    Tran                  NaN
1  Jane Doe  Jane     Doe                  NaN
2  John Doe  John     Doe                  NaN
0       NaN   tin  nguyen                  NaN
0       NaN   tin  nguyen  tintokaka@gmail.com

In [68]:
df = df[df['personal email'].isnull()]

In [69]:
df

  full name first    last personal email
0  Tin Tran   Tin    Tran            NaN
1  Jane Doe  Jane     Doe            NaN
2  John Doe  John     Doe            NaN
0       NaN   tin  nguyen            NaN

In [70]:
df_ = pd.DataFrame({
    'first': ['Coney', 'Jane', 'John'],
    'last' : ['Schafer', 'Doe', 'Doe'],
    'year' : [1, 100, 10]
})

In [71]:
df_

   first     last  year
0  Coney  Schafer     1
1   Jane      Doe   100
2   John      Doe    10

In [72]:
df_['email'] = df_['first'] + df_['last'] + '@gmail.com'

In [73]:
df_.set_index('first', inplace = True)

In [74]:
df_ = df_.reset_index()
df_

   first     last  year                   email
0  Coney  Schafer     1  ConeySchafer@gmail.com
1   Jane      Doe   100       JaneDoe@gmail.com
2   John      Doe    10       JohnDoe@gmail.com

In [75]:
df_.sort_values(by='last', inplace = True)

In [76]:
df_

   first     last  year                   email
1   Jane      Doe   100       JaneDoe@gmail.com
2   John      Doe    10       JohnDoe@gmail.com
0  Coney  Schafer     1  ConeySchafer@gmail.com

In [77]:
df_.sort_values(by=['last', 'year'], ascending = [True, False], inplace = True)

In [78]:
df_

   first     last  year                   email
1   Jane      Doe   100       JaneDoe@gmail.com
2   John      Doe    10       JohnDoe@gmail.com
0  Coney  Schafer     1  ConeySchafer@gmail.com

In [79]:
df_['year'].nlargest(2)

1    100
2     10
Name: year, dtype: int64

In [80]:
df_.nlargest(2, 'year')

  first last  year              email
1  Jane  Doe   100  JaneDoe@gmail.com
2  John  Doe    10  JohnDoe@gmail.com